{"list_description": [{"file_name": "srai_core/script/srai_deploy.py", "description": "{\n    \"list_change\": [\n        {\n            \"description\": \"The code comprises a main function which calls an asynchronous srai_deploy function. The srai_deploy function performs tasks such as building, releasing, and deploying docker images based on the instructions specified in the deployment_file.json. It also has several input checks, mainly verifying the presence of mandatory target details such as 'account_id', 'region_name', and 'release_type'. If these checks fail, the program will terminate with an error message.\"\n        }\n    ]\n}"}, {"file_name": "srai_core/script/srai_release.py", "description": "{\n    \"list_change\": [\n        {\n            \"description\": \"The code sets up a command handler base for building and releasing Docker containers, which are specified in a given deployment file. It validates command arguments to ensure a deployment file is provided, loads the deployment file's data, and sequentially builds and releases every entry listed in the deployment file. If there's an unrecognized release type, the program prints an error and exits.\"\n        }\n    ]\n}"}, {"file_name": "srai_core/script/stop_docker_remote.py", "description": "{\n    \"list_change\": [\n        {\n            \"description\": \"The change checks if a key file for a docker container exists in a specified path. If it doesn't, it raises an exception. If it does, it moves on to authenticate SSH using specific host details. Thereafter, it fetches the image tag, extracts the container name, and checks if the container is in operation. If the container is in operation, it stops and removes the container.\"\n        }\n    ]\n}"}, {"file_name": "srai_core/tools_docker.py", "description": "{\n    \"list_change\": [\n        {\n            \"description\": \"Refactor commands from synchronous to async, allowing concurrency. Update command handlers to become asynchronous. Modify container management functions such as stop_container, remove_container and build_docker, adjusting Docker operations and improving efficiency. Command parameters updated.\"\n        }\n    ]\n}"}]}