{"title": "title_0", "text generated": "Ever since technology provided us the liberty to convert voice notes into text, it has opened up new ways to explore and utilize this feature. Confessions first - the genesis of this blog post comes from a voice transcript; an experiment, if you will, involving converting casual spoken language into a more formal, 'corporate' tone commonly used in writing. One of the prominent considerations while doing this was - \"How long does a voice note need to be to create a substantive blog post?\"\n\nAn initial concern that arose was - voice transcripts can get overloaded and yield lengthy text potentially disengaging the reader. One might end up with words or phrases deemed extraneous, potentially cut out to fit the desired word count. However, we must remember—as we unscramble this experiment—that the conversion process will inevitably retain all elements, relevant or otherwise, which will be visible in the final output.\n\nSwitching gears slightly, I deliberated on whether or not to also include the original voice recording in future posts. Both factors of file size and convenience come into play here. As I write (or speak), platforms like LinkedIn could be looking at the feasibility of incorporating voice notes into their portfolio, thus prompting me to post only the transcripts. This reflection led me to a further exploration of various social media management platforms. Yet, one stumbling block remained. The cost factor. Regrettably, most of these platforms come with a hefty price tag of around $100 a month - a cost too steep for someone focusing solely on one channel, say LinkedIn. \n\nTo mitigate this, I contemplated implementing the API myself. However, the increasingly convoluted and closed-off nature of APIs have made it a daunting task, necessitating the intervention of third-party software. Consequently, I conclude this voice note experiment and look forward to seeing how the resulting transcript fashions itself into a structured, readable blog post. I intend this novel mode of creating content to bring more fluidity and innovation—cutting across more social media platforms—in the near future. Be it the transcript or the prompter, the saga continues."}